# Aula 05 - Pandas IV
---

<img src="https://lc-public-assets.s3.sa-east-1.amazonaws.com/images/Logos/logoLcPng.webp" width="220px" style="position: absolute; top: 15px; right: 20px; border-radius: 5px;" />

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

## Transformação de Dados


### `map`

In [4]:
df['Sexo'] = df['Sex'].map({
    'male': 0,
    'female': 1
})

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sexo
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

#### `apply`

Aplicar uma função sobre o DataFrame (ou uma Series).

1. Funções pré-implementadas
2. Funções: def
3. Funções lambda

In [6]:
df['Age'].apply(np.max)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [7]:
df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [8]:
def multiplicar_por_dois(taxa):
    print(f'Taxa: {taxa}')
    return taxa * 2

df['Fare'][:10].apply(multiplicar_por_dois)

Taxa: 7.25
Taxa: 71.2833
Taxa: 7.925
Taxa: 53.1
Taxa: 8.05
Taxa: 8.4583
Taxa: 51.8625
Taxa: 21.075
Taxa: 11.1333
Taxa: 30.0708

0     14.5000
1    142.5666
2     15.8500
3    106.2000
4     16.1000
5     16.9166
6    103.7250
7     42.1500
8     22.2666
9     60.1416
Name: Fare, dtype: float64

In [9]:
def dolar(taxa :float):
    return '$' + ('%.2f' % taxa)

df['Fare'][:10].apply(dolar)

0     $7.25
1    $71.28
2     $7.92
3    $53.10
4     $8.05
5     $8.46
6    $51.86
7    $21.07
8    $11.13
9    $30.07
Name: Fare, dtype: object

#### Utilizando função `lambda`

In [10]:
#função anônima lambda recebe taxa e retorna taxa * 2
df['Fare'].apply(lambda taxa: taxa * 2)

0       14.5000
1      142.5666
2       15.8500
3      106.2000
4       16.1000
         ...
886     26.0000
887     60.0000
888     46.9000
889     60.0000
890     15.5000
Name: Fare, Length: 891, dtype: float64

In [11]:
#Outro exemplo de lambda
somar = lambda num1, num2: num1 + num2
somar(1, 2)

3

#### `get_dummies`

Útil na conversão de dados categóricos (qualitativos) em dados numéricos (quantitativos)

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sexo
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [13]:
pd.get_dummies(df)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sexo,"Name_Abbing, Mr. Anthony","Name_Abbott, Mr. Rossmore Edward",...,Cabin_F G73,Cabin_F2,Cabin_F33,Cabin_F38,Cabin_F4,Cabin_G6,Cabin_T,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,...,0,0,0,0,0,0,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,...,0,0,0,0,0,0,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,0,0,...,0,0,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,27.0,0,0,13.0000,0,0,0,...,0,0,0,0,0,0,0,0,0,1
887,888,1,1,19.0,0,0,30.0000,1,0,0,...,0,0,0,0,0,0,0,0,0,1
888,889,0,3,NaN,1,2,23.4500,1,0,0,...,0,0,0,0,0,0,0,0,0,1
889,890,1,1,26.0,0,0,30.0000,0,0,0,...,0,0,0,0,0,0,0,1,0,0
890,891,0,3,32.0,0,0,7.7500,0,0,0,...,0,0,0,0,0,0,0,0,1,0

In [14]:
df_aux = df[['Survived', 'Pclass', 'Sex', 'Age']]
df_aux.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [15]:
pd.get_dummies(df_aux)

     Survived  Pclass   Age  Sex_female  Sex_male
0           0       3  22.0           0         1
1           1       1  38.0           1         0
2           1       3  26.0           1         0
3           1       1  35.0           1         0
4           0       3  35.0           0         1
..        ...     ...   ...         ...       ...
886         0       2  27.0           0         1
887         1       1  19.0           1         0
888         0       3   NaN           1         0
889         1       1  26.0           0         1
890         0       3  32.0           0         1

[891 rows x 5 columns]

In [16]:
#Se eliminar uma coluna, se todas as que restarem forem "0", seria o valor da coluna apagada
pd.get_dummies(df_aux, drop_first=True)

     Survived  Pclass   Age  Sex_male
0           0       3  22.0         1
1           1       1  38.0         0
2           1       3  26.0         0
3           1       1  35.0         0
4           0       3  35.0         1
..        ...     ...   ...       ...
886         0       2  27.0         1
887         1       1  19.0         0
888         0       3   NaN         0
889         1       1  26.0         1
890         0       3  32.0         1

[891 rows x 4 columns]

## Tratamento de Dados Ausentes

1. `isnull/isna`
2. `dropna`
3. `fillna`

In [19]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sexo
0,False,False,False,False,False,False,False,False,False,False,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False,False

In [18]:
# Quantos dados são nulos por coluna?
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Sexo             0
dtype: int64

In [20]:
# Primeiro Exemplo
dados = np.array([[1,      2, np.nan],
                  [4, np.nan, np.nan],
                  [7,      8,      9]])

df_exemplo = pd.DataFrame(dados, columns='A B C'.split())

In [21]:
df_exemplo

     A    B    C
0  1.0  2.0  NaN
1  4.0  NaN  NaN
2  7.0  8.0  9.0

df.fropna() # exlui a linha que tiver um dado nulo

In [23]:
df.drop(['Cabin', 'Sexo'], axis = 1, inplace = True)

In [24]:
df.isnull().sum() # fillna: preenche o que for nulo

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

## Junção de DataFrames

In [14]:
dados = np.arange(1, 10).reshape(3,3)

In [15]:
dados

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [16]:
df1 = pd.DataFrame(dados, columns='A B C'.split())
df2 = pd.DataFrame(dados, columns='A B C'.split())
df3 = pd.DataFrame(dados, columns='D E F'.split())

#### `concat`

#### `merge`

#### `join`